Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/composition-vs-inheritance_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: composition-vs-inheritance title: Composition vs Inheritance permalink: docs/composition-vs-inheritance.html redirect_from:
ja: --- id: composition-vs-inheritance title: コンポジション vs 継承 permalink: docs/composition-vs-inheritance.html redirect_from:

source: React has a powerful composition model, and we recommend using composition instead of inheritance to reuse code between components.
ja: React は強力なコンポジションモデルを備えており、コンポーネント間のコードの再利用には継承よりもコンポジションをお勧めしています。

source: In this section, we will consider a few problems where developers new to React often reach for inheritance, and show how we can solve them with composition.
ja: この章では、React を始めて間もない開発者が継承に手を出した時に陥りがちないくつかの問題と、コンポジションによりその問題がどのように解決できるのかについて考えてみます。

source: ## Containment {#containment}
ja: ## 子要素の出力 (Containment) {#containment}

source: Some components don't know their children ahead of time.
ja: コンポーネントの中には事前には子要素を知らないものもあります。

source: This is especially common for components like `Sidebar` or `Dialog` that represent generic "boxes".
ja: これは `Sidebar` や `Dialog` のような汎用的な "入れ物" をあらわすコンポーネントではよく使われています。

source: We recommend that such components use the special `children` prop to pass children elements directly into their output:
ja: このようなコンポーネントでは特別な `children` という props を使い、以下のようにして受け取った子要素を出力することができます。

source: This lets other components pass arbitrary children to them by nesting the JSX:
ja: これにより他のコンポーネントから JSX をネストすることで任意の子要素を渡すことができます。

source: Anything inside the `<FancyBorder>` JSX tag gets passed into the `FancyBorder` component as a `children` prop.
ja: `<FancyBorder>` JSX タグの内側のあらゆる要素は `FancyBorder` に `children` という props として渡されます。

source: Since `FancyBorder` renders `{props.children}` inside a `<div>`, the passed elements appear in the final output.
ja: `FancyBorder` は `<div>` の内側に `{props.children}` をレンダーするので、渡された要素が出力されます。

source: While this is less common, sometimes you might need multiple "holes" in a component.
ja: あまり一般的ではありませんが、複数の箇所に子要素を追加したいケースも考えられます。

source: In such cases you may come up with your own convention instead of using `children`:
ja: そのようなケースでは以下のように `children` の props の代わりに独自の props を作成して渡すことができます。

source: React elements like `<Contacts />` and `<Chat />` are just objects, so you can pass them as props like any other data.
ja: `<Contacts />` や `<Chat />` のような React の要素はただのオブジェクトなので、他のあらゆるデータと同様に props として渡すことができます。

source: This approach may remind you of "slots" in other libraries but there are no limitations on what you can pass as props in React.
ja: このアプローチは他のライブラリで言うところの slot に似ていると感じるかもしれませんが、React のコンポーネントに props として渡せるものに制限はありません。

source: ## Specialization {#specialization}
ja: ## 特化したコンポーネント (Specialization) {#specialization}

source: Sometimes we think about components as being "special cases" of other components.
ja: コンポーネントを他のコンポーネントの "特別なケース" として考えることがあります。

source: For example, we might say that a `WelcomeDialog` is a special case of `Dialog`.
ja: 例えば、`WelcomeDialog` は `Dialog` の特別なケースと言えるでしょう。

source: In React, this is also achieved by composition, where a more "specific" component renders a more "generic" one and configures it with props:
ja: React ではこれもコンポジションで実現できます。汎用的なコンポーネントに props を渡して設定することで、より特化したコンポーネントを作成することができます。

source: Composition works equally well for components defined as classes:
ja: コンポジションはクラスとして定義されたコンポーネントでも同じように動作します。

source: ## So What About Inheritance?
ja: ## 継承はどうなの？

source: At Facebook, we use React in thousands of components, and we haven't found any use cases where we would recommend creating component inheritance hierarchies.
ja: Facebook では、何千というコンポーネントで React を使用していますが、コンポーネント継承による階層構造が推奨されるケースは全く見つかっていません。

source: Props and composition give you all the flexibility you need to customize a component's look and behavior in an explicit and safe way.
ja: props とコンポジションにより、コンポーネントの見た目と振る舞いを明示的かつ安全にカスタマイズするのに十分な柔軟性が得られます。

source: Remember that components may accept arbitrary props, including primitive values, React elements, or functions.
ja: コンポーネントはどのような props でも受け付けることができ、それはプリミティブ値でも、React 要素でも、あるいは関数であってもよい、ということに留意してください。

source: If you want to reuse non-UI functionality between components, we suggest extracting it into a separate JavaScript module.
ja: コンポーネント間で非 UI 機能を再利用したい場合は、それを別の JavaScript モジュールに抽出することをお勧めします。

source: The components may import it and use that function, object, or a class, without extending it.
ja: コンポーネントはその関数やオブジェクト、クラスなどを継承することなくインポートすることで使用することができるでしょう。
